DeviceTvmBrowserExtensions
| summarize
     TotalExtensions = dcount(ExtensionId),
     ExtensionNames = make_set(ExtensionName)
     by DeviceId
| join DeviceInfo on DeviceId
| project DeviceName, TotalExtensions, ExtensionNames
| top 10 by TotalExtensions
